import { MyProject } from "./MyProject";
import { SMyProjects } from "./MyProjects.styled";
import { FilterIcon } from "./assets/filter-icon";
import { HamburgerIcon } from "./assets/hamburger-icon";

const mockData = [
  {
    id: "1",
    name: "python-ის სტაჟირება",
    user_role: "Frontend Developer",
    description:
      "კურსის მოკლე აღწერა,  კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა,კურსის მოკლე აღწერა, კურსის მოკლე აღწერა,  კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა",
    image: null,
    date: new Date(),
    url: "url_to_project_1",
    type: "პრაქტიკული პროექტი",
    lecturer: "გიორგი გიორგაძე",
  },

  {
    id: "2",
    name: "python-ის კურსი",
    user_role: "Frontend Developer",
    description:
      "კურსის მოკლე აღწერა,  კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა,კურსის მოკლე აღწერა, კურსის მოკლე აღწერა,  კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა",
    image: null,
    date: new Date(),
    url: "url_to_project_2",
    type: "საფინალო პროექტი",
    lecturer: "გიორგი გიორგაძე",
  },

  {
    id: "3",
    name: "ნარატივის ჰაკათონი",
    user_role: "Frontend Developer",
    description:
      "კურსის მოკლე აღწერა,  კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა,კურსის მოკლე აღწერა, კურსის მოკლე აღწერა,  კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა",
    image: null,
    date: new Date(),
    url: "url_to_project_3",
    type: "პრაქტიკული პროექტი",
    lecturer: "გიორგი გიორგაძე",
  },

  {
    id: "4",
    name: "ნარატივის ჰაკათონი",
    user_role: "Frontend Developer",
    description:
      "კურსის მოკლე აღწერა,  კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა,კურსის მოკლე აღწერა, კურსის მოკლე აღწერა,  კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა",
    image: null,
    date: new Date(),
    url: "url_to_project_4",
    type: "საფინალო პროექტი",
    lecturer: "გიორგი გიორგაძე",
  },
];

export const MyProjects = () => {
  return (
    <SMyProjects>
      <h2>პროექტები</h2>
      <div className="filters">
        <button className="global">
          <HamburgerIcon />
        </button>
        <button className="local">
          <FilterIcon />
        </button>
      </div>

      <div>
        {mockData.map((project) => {
          return <MyProject key={project.id} {...project} />;
        })}
      </div>
    </SMyProjects>
  );
};
