import { MyProject } from "./MyProject";
import { SMyProjects } from "./MyProjects.styled";

const mockData = [
  {
    id: "1",
    name: "python-ის სტაჟირება",
    user_role: "Frontend Developer",
    description:
      "კურსის მოკლე აღწერა,  კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა,კურსის მოკლე აღწერა, კურსის მოკლე აღწერა,  კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა",
    image: "https://random.imagecdn.app/160/220",
    date: new Date(),
    url: "url_to_project_1",
    type: "პრაქტიკული პროექტი",
    lecturer: "გიორგი გიორგაძე",
  },

  {
    id: "2",
    name: "python-ის კურსი",
    user_role: "Frontend Developer",
    description:
      "კურსის მოკლე აღწერა,  კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა,კურსის მოკლე აღწერა, კურსის მოკლე აღწერა,  კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა",
    image: "https://random.imagecdn.app/160/220",
    date: new Date(),
    url: "url_to_project_2",
    type: "საფინალო პროექტი",
    lecturer: "გიორგი გიორგაძე",
  },

  {
    id: "3",
    name: "ნარატივის ჰაკათონი",
    user_role: "Frontend Developer",
    description:
      "კურსის მოკლე აღწერა,  კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა,კურსის მოკლე აღწერა, კურსის მოკლე აღწერა,  კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა",
    image: "https://random.imagecdn.app/160/220",
    date: new Date(),
    url: "url_to_project_3",
    type: "პრაქტიკული პროექტი",
    lecturer: "გიორგი გიორგაძე",
  },

  {
    id: "4",
    name: "ნარატივის ჰაკათონი",
    user_role: "Frontend Developer",
    description:
      "კურსის მოკლე აღწერა,  კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა,კურსის მოკლე აღწერა, კურსის მოკლე აღწერა,  კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა, კურსის მოკლე აღწერა",
    image: "https://random.imagecdn.app/160/220",
    date: new Date(),
    url: "url_to_project_4",
    type: "საფინალო პროექტი",
    lecturer: "გიორგი გიორგაძე",
  },
];

export const MyProjects = () => {
  return (
    <SMyProjects>
      <h2>ჩემი პროექტები</h2>
      <div>
        <button>globalFilter</button>
        <button>filter</button>
      </div>

      <div>
        {mockData.map((project) => {
          return <MyProject key={project.id} {...project} />;
        })}
      </div>
    </SMyProjects>
  );
};
